<!doctype html>
<html>
<head>
<title>中国科学技术大学天文爱好者协会</title>
<?php include '../publichead.html'; ?>
</head>
<body>


<div class="container">
	<div class="row clearfix">
		<div class="col-md-12 column">
		<?php include '../header.html'; ?>
		<?php include '../nav.html'; ?>	
			<div class="jumbotron">
<!-- article -->
</article>
<h2 style="text-align:center">科大天文爱好者协会简介</h1>
<br />
<p style="text-indent:2em;">
科大天文协会前身是工院的天文小组，但是一直没有发展起来，只是爱好者自己小规模进行天文观测活动。2004年，随着爱好者和观测次数的增加，有了成立天文协会的知识技术基础。2004年的两大天象（5月5日月全食、6月8日金星凌日）以及5月科技开放周天体物理中心开放实验室（天文台）开始使用，使准天文协会积累了一些组织活动的经验。 </p>

<p style="text-indent:2em;">
2004年3月30日，天文协会正式挂牌成立了，属于学校科技类社团，名义上属于安徽省天文学会。同年5月29日召开第一次会员大会。新生的天文协会遇到的困难还是比较多的，依靠各位骨干的努力工作得以维持。随着组织活动的增多以及新会员的崛起，目前协会已经脱离了成立之初的困顿，已经初具规模，并且必将会把活动组织得越来越好。 </p>

<p style="text-indent:2em;">
目前协会拥有许多装备：254mmDOB式反射镜一台，25*102双筒镜1台，102mm折射镜一台，150mm马卡式折反镜一台，还有一些会员拥有70、50mm双筒和小型折射、反射式望远镜。目前的活动分为校内和校外，校内依靠天文台，组织对月亮、太阳、大行星的观测以及天文科普活动，校外进行户外深空天体和流星雨、彗星的观测活动，并且在提高观测的科学目的、无线电观测流星、天文摄影等方面也正在积极探索。 </p>

<p style="text-indent:2em;">
天文协会是学校天文爱好者相互交流学习的舞台，也是学校天文爱好者面向校内师生以及社会大众的科普宣传的舞台，在这里你可以学到许多天文知识，认识全天星座，收揽许许多多深空天体，浪漫地细数流星，看国际空间站划过夜空……也可以展示你的社会活动能力，领导能力，演讲能力，为提高全民科学素养贡献力量。</p>

<p>
<strong>联系方式</strong><br />
社团QQ群：中国科大天爱协会348223715<br />
微信公众号：AstronomyUSTC<br />
</p>
</article>
<article>
<h2 style="text-align:center">天协网站简介与致谢</h2>
<br />
<p style="text-indent:2em">
天协网站最开始只是个小项目，目的是用在线的mysql数据库取代曾经放在社团办公室、总是丢的小本子，来管理社团的装备借用相关事务。网站从2018年7月开始构建，使用php开发。最开始的网站界面非常丑并且没有响应式设计（因为我的CSS没有学到家呀嘤嘤嘤），在手机上打开会出现排版错乱。感谢陈培学姐，让我了解到bootstrap。我花了一周的时间用bootstrap重新构建了前端页面（在此之前我还只会用php写写后端，几乎没有接触过前端开发），在由中科大Linux用户协会提供的服务器上短暂测试后，将网站上线阿里云（不是广告，阿里云的服务器是我自己出钱租的所以小可爱们可不可以捐助一下我呀嘤嘤嘤）。
</p>
<p style="text-indent:2em">
后来，网站的功能越来越完善，我们加入了观测成就系统，加入了会员VIP等级制度（误），并依托服务器上的wordpress进行信息发布和内容管理（这也是我初次接触ajax）。我们通过NASA的API加入了APOD的功能，可以欣赏美丽的天文图片（虽然加载速度实在慢）。为了给会员们快速提供天气信息，我们通过晴天钟的API加入了天气预报。这里要特别感谢晴天钟的维护者，他们的API一开始并不能通过AJAX进行跨域请求，在我提交issue后的第二天他们就进行了更新。现在我们的网站还在不断完善，我也在开发过程中不断的学习新的知识。
</p>
<p style="text-indent:2em">
最后，要感谢LUG的豆豆学长，以及一众在网站开发过程中给我建议和鼓励的朋友和同学们；感谢天协的朋友自始至终给我鼓励和信任；感谢忍受我在暑假期间早上7点起床敲机械键盘的室友们。
</p>
</article>

<!-- /article -->
			</div>
		</div>
	</div>
	<?php include '../footer.html'; ?>
</div>
</body>
</html>
